In [1]:
def make_number(alphanum):
    sign = 1
    if alphanum and alphanum[0] in '+-':
        sign = int(alphanum[0] + '1')
        alphanum = alphanum[1:]
    try:    
        return float(''.join(it.takewhile(lambda x: x.isdigit() 
                                           or x == '.', alphanum))) * sign
    except ValueError:
        return 0

In [42]:
def extrtact_number(alphanum):
    return [float (s) for s in re.findall(r'-?\d+\.?\d*',alphanum )]

In [44]:
import pandas as pd 
import itertools as it
import re

In [38]:
df1 = {
'Name':['26.5KMM','63.5LM','KM56','P768','56'],
'Value1':['26.6KM','26.6KM/L','26.6M/L','26.6l','+20'],
'Value2':['Anand','Babu','s','ss','sss']
}

In [39]:
df=pd.DataFrame(df1)

In [40]:
df.head()

      Name    Value1 Value2
0  26.5KMM    26.6KM  Anand
1   63.5LM  26.6KM/L   Babu
2     KM56   26.6M/L      s
3     P768     26.6l     ss
4       56       +20    sss

In [45]:
df.applymap(lambda x: extrtact_number(x))

      Name  Value1 Value2
0   [26.5]  [26.6]     []
1   [63.5]  [26.6]     []
2   [56.0]  [26.6]     []
3  [768.0]  [26.6]     []
4   [56.0]  [20.0]     []

In [36]:
df['Name'].apply(lambda x: make_number(x))

0    26.5
1    63.5
2     0.0
3     0.0
4    56.0
Name: Name, dtype: float64

In [37]:
df['Name'].map(lambda x: make_number(x))

0    26.5
1    63.5
2     0.0
3     0.0
4    56.0
Name: Name, dtype: float64